<h2 style='color:blue' align="center">Decision Tree Classification</h2>

<h2 style='color:green' align="center">The target column, or what we want to predict, is whether individuals make more than 100k a year or not.</h2>

# Importing Libraries

In [16]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

# Fetching Data

In [17]:
salary=pd.read_csv("salaries.csv")

In [18]:
salary

       company                  job     degree  salary_more_then_100k
0       google      sales executive  bachelors                      0
1       google      sales executive    masters                      0
2       google     business manager  bachelors                      1
3       google     business manager    masters                      1
4       google  computer programmer  bachelors                      0
5       google  computer programmer    masters                      1
6   abc pharma      sales executive    masters                      0
7   abc pharma  computer programmer  bachelors                      0
8   abc pharma     business manager  bachelors                      0
9   abc pharma     business manager    masters                      1
10    facebook      sales executive  bachelors                      1
11    facebook      sales executive    masters                      1
12    facebook     business manager  bachelors                      1
13    facebook     business manager    masters                      1
14    facebook  computer programmer  bachelors                      1
15    facebook  computer programmer    masters                      1

# Label Encoding

In [20]:
from sklearn.preprocessing import LabelEncoder
l1=LabelEncoder()
l2=LabelEncoder()
l3=LabelEncoder()

salary['comp_encoder']=l1.fit_transform(salary['company'])
salary['job_encoder']=l2.fit_transform(salary['job'])
salary['degree_encoder']=l3.fit_transform(salary['degree'])

In [21]:
salary

,company,job,degree,salary_more_then_100k,comp_encoder,job_encoder,degree_encoder
0,google,sales executive,bachelors,0,2,2,0
1,google,sales executive,masters,0,2,2,1
2,google,business manager,bachelors,1,2,0,0
3,google,business manager,masters,1,2,0,1
4,google,computer programmer,bachelors,0,2,1,0
5,google,computer programmer,masters,1,2,1,1
6,abc pharma,sales executive,masters,0,0,2,1
7,abc pharma,computer programmer,bachelors,0,0,1,0
8,abc pharma,business manager,bachelors,0,0,0,0
9,abc pharma,business manager,masters,1,0,0,1
10,facebook,sales executive,bachelors,1,1,2,0
11,facebook,sales executive,masters,1,1,2,1
12,facebook,business manager,bachelors,1,1,0,0
13,facebook,business manager,masters,1,1,0,1
14,facebook,computer programmer,bachelors,1,1,1,0
15,facebook,computer programmer,masters,1,1,1,1

In [22]:
salary=salary.drop(columns=['company','job','degree'])

In [23]:
salary.head()

   salary_more_then_100k  comp_encoder  job_encoder  degree_encoder
0                      0             2            2               0
1                      0             2            2               1
2                      1             2            0               0
3                      1             2            0               1
4                      0             2            1               0

In [24]:
x=salary[['comp_encoder','job_encoder','degree_encoder']]

In [25]:
y=salary['salary_more_then_100k']

In [26]:
x

    comp_encoder  job_encoder  degree_encoder
0              2            2               0
1              2            2               1
2              2            0               0
3              2            0               1
4              2            1               0
5              2            1               1
6              0            2               1
7              0            1               0
8              0            0               0
9              0            0               1
10             1            2               0
11             1            2               1
12             1            0               0
13             1            0               1
14             1            1               0
15             1            1               1

In [27]:
y

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [28]:
from sklearn.tree import DecisionTreeClassifier

In [29]:
model=DecisionTreeClassifier()

In [30]:
model.fit(x,y)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [31]:
model.score(x,y)

1.0

**Is salary of Google, Computer Engineer, Bachelors degree > 100 k ?**

In [32]:
model.predict([[2,1,0]])

array([0], dtype=int64)

**Is salary of Google, Computer Engineer, Masters degree > 100 k ?**

In [33]:
model.predict([[2,1,1]])

array([1], dtype=int64)

# Problem 2: Build decision tree model to predict survival based on certain parameters



##### In this file using following columns build a model to predict if person would survive or not,

1. Pclass
1. Sex
1. Age
1. Fare

##### Calculate score of your model

In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
titanic=pd.read_csv("titanic.csv")

In [2]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
X=titanic[['Pclass','Sex','Age','Fare']]

In [4]:
Y=titanic['Survived']

In [5]:
X.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [6]:
Y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [7]:
import warnings 
warnings.filterwarnings("ignore")
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
X['Sex_enc']=le.fit_transform(X['Sex'])

In [8]:
X.head()

   Pclass     Sex   Age     Fare  Sex_enc
0       3    male  22.0   7.2500        1
1       1  female  38.0  71.2833        0
2       3  female  26.0   7.9250        0
3       1  female  35.0  53.1000        0
4       3    male  35.0   8.0500        1

In [9]:
X=X.drop(columns=['Sex'])

AGE column contains some missing data

In [10]:
X.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [11]:
X.Age=X.Age.fillna(X.Age.mean())

In [12]:
X.head()

   Pclass   Age     Fare  Sex_enc
0       3  22.0   7.2500        1
1       1  38.0  71.2833        0
2       3  26.0   7.9250        0
3       1  35.0  53.1000        0
4       3  35.0   8.0500        1

In [13]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,Y,test_size=0.2)

In [14]:
len(X_train)

712

In [15]:
from sklearn.tree import DecisionTreeClassifier
modelling=DecisionTreeClassifier(criterion='entropy')

In [16]:
modelling.fit(X_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='entropy', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [17]:
modelling.score(X_test,y_test)

0.7877094972067039